backend/tests/performance/load-test.yml
config:
  target: "http://localhost:5080"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 20
      name: "Sustained load"
    - duration: 60
      arrivalRate: 40
      name: "Stress test"
    - duration: 30
      arrivalRate: 5
      name: "Cool down"

scenarios:
  - name: "User Registration"
    weight: 10
    flow:
      - post:
          url: "/api/auth/register"
          json:
            name: "LoadTestUser"
            email: "loadtest@example.com"
            password: "testpass123"

  - name: "User Login"
    weight: 15
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test@example.com"
            password: "testpass123"
          capture:
            - json: "$.token"
              as: "authToken"

  - name: "Get All Courses"
    weight: 20
    flow:
      - get:
          url: "/api/courses"

  - name: "Get Course by ID"
    weight: 15
    flow:
      - get:
          url: "/api/courses/507f1f77bcf86cd799439011"

  - name: "Get All Jobs"
    weight: 20
    flow:
      - get:
          url: "/api/jobs"

  - name: "Search Jobs"
    weight: 10
    flow:
      - get:
          url: "/api/jobs/search?q=developer"

  - name: "Get Featured Jobs"
    weight: 5
    flow:
      - get:
          url: "/api/jobs/featured"

  - name: "Get Notifications"
    weight: 5
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test@example.com"
            password: "testpass123"
      - get:
          url: "/api/notifications"
          headers:
            Authorization: "Bearer {{ authToken }}"