backend/tests/performance/smoke-test.yml
config:
  target: "http://localhost:5080"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Light load"
  plugins:
    expect: {}

scenarios:
  - name: "Health Check"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200

  - name: "Get Courses with Filters"
    flow:
      - get:
          url: "/api/courses?category=Web%20Development&level=beginner"
          expect:
            - statusCode: 200

  - name: "Get Jobs with Pagination"
    flow:
      - get:
          url: "/api/jobs?page=1&limit=20"
          expect:
            - statusCode: 200

  - name: "Get Trending Skills"
    flow:
      - get:
          url: "/api/trending-skills"
          expect:
            - statusCode: 200